Smart4J Framework学习/demo/src/main/resources/wss4j_inbound_message2.xml

<!-- passwordType=PasswordDigest -->
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
                       xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
                       soap:mustUnderstand="1">
            <wsse:UsernameToken wsu:Id="UsernameToken-db5811ca-0e3a-45a4-a8b0-7dea7e894d4d">
                <wsse:Username>client</wsse:Username>
                <wsse:Password
                        Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">
                    jwV7DKDZ9TOUaFY+IEX6oBnbjs4=
                </wsse:Password>
                <wsse:Nonce
                        EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">
                    ntMXlzeQfUjK/xhCgEDnuA==
                </wsse:Nonce>
                <wsu:Created>2018-01-16T09:11:49.821Z</wsu:Created>
            </wsse:UsernameToken>
        </wsse:Security>
    </SOAP-ENV:Header>
    <soap:Body>
        <ns2:greet xmlns:ns2="http://soap_spring_cxf_wss4j.ws.demo/">
            <arg0>Jack</arg0>
        </ns2:greet>
    </soap:Body>
</soap:Envelope>

